from time import sleep
print("Музикальний чат бот")
print(" ")
sleep(1)
print("Як користуватися?")
sleep(1)
print("Просто відповідайте на запитання бота та він допоможе тобі підібрати музику для прослуховування")
sleep(2)
print(" ")
print("Якому стилю музики ви надаєте перевагу? (відповідь надішліть цифрою, яка відповідає обраному варіанту)")
a = input("1 - хіп-хоп;  2 - рок;  3 - поп;")
if a == "1":
    print("Якій музиці ви надаєте перевагу?")
    a2 = input("1 - українська;  2 - іноземна;")
    if a2 == "1":
        print("Яким рокам музики ви надаєте перевагу?")
        a3 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a3 == "1":
            print("Можу порекомендувати послухати вам пісні гурту ТНМК (Танок на майдані Конґо). ")
        elif a3 == "2":
            print("Можу порекомендувати послухати вам наступних виконавців: Тартак, Alyona Alyona")
        elif a3 == "3":
            print("Можу порекомендувати послухати вам наступних виконавців: Chico & Qatoshi, Jockii Druce, OTOY")
        else:
            print("Вибачте, я не розумію ваш вибір.")
    elif a2 == "2":
        print("Яким рокам музики ви надаєте перевагу?")
        a4 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a4 == "1":
            print("Можу порекомендувати послухати вам наступних виконавців: Eminem, 50 Cent, Jay-Z.")
        elif a4 == "2":
            print("Можу порекомендувати послухати вам наступних виконавців: Kendrick Lamar, Drake, Travis Scott.")
        elif a4 == "3":
            print("Можу порекомендувати послухати вам наступних виконавців: Cardi B, Post Malone, Roddy Ricch.")
        else:
            print("Вибачте, я не розумію ваш вибір.")
elif a == "2":
    print("Якій музиці ви надаєте перевагу?")
    a5 = input("1 - українська;  2 - іноземна;")
    if a5 == "1":
        print("Яким рокам музики ви надаєте перевагу?")
        a6 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a6 == "1":
            print("Можу порекомендувати послухати вам пісні гурту Океан Ельзи. ")
        elif a6 == "2":
            print("Можу порекомендувати послухати вам пісні гурту Hardkiss. ")
        elif a6 == "3":
            print("Вибачте, нікого не можу порекомендувати.")
        else:
            print("Вибачте, я не розумію ваш вибір.")
    elif a5 == "2":
        print("Яким рокам музики ви надаєте перевагу?")
        a7 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a7 == "1":
            print("Можу порекомендувати послухати вам наступних виконавців: Linkin Park, Red Hot Chili Peppers, Green Day.")
        elif a7 == "2":
            print("Можу порекомендувати послухати вам наступних виконавців: Arctic Monkeys, Foo Fighters, Muse.")
        elif a7 == "3":
            print("Можу порекомендувати послухати вам наступних виконавців: Maneskin, Imagine Dragons, Greta Van Fleet.")
        else:
            print("Вибачте, я не розумію ваш вибір.")
elif a == "3":
    print("Якій музиці ви надаєте перевагу?")
    a8 = input("1 - українська;  2 - іноземна;")
    if a8 == "1":
        print("Яким рокам музики ви надаєте перевагу?")
        a9 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a9 == "1":
            print("Можу порекомендувати послухати вам пісні гурту Бумбокс та Скрябіна.")
        elif a9 == "2":
            print("Можу порекомендувати послухати вам наступних виконавців: Монатік, Тіна Кароль.")
        elif a9 == "3":
            print("Можу порекомендувати послухати вам наступних виконавців: Tember Blanche, YAKTAK, Klavdia Petrivna")
        else:
            print("Вибачте, я не розумію ваш вибір.")
    elif a8 == "2":
        print("Яким рокам музики ви надаєте перевагу?")
        a10 = input("1 - 2000-x;  2 - 2010-x;  3 - 2020x;")
        if a10 == "1":
            print("Можу порекомендувати послухати вам наступних виконавців: Maroon 5, Lady Gaga, Justin Timberlake.")
        elif a10 == "2":
            print("Можу порекомендувати послухати вам наступних виконавців: The Weeknd, Ed Sheeran, Justin Bieber.")
        elif a10 == "3":
            print("Можу порекомендувати послухати вам наступних виконавців: Billie Eilish, Dua Lipa, Jack Harlow.")
        else:
            print("Вибачте, я не розумію ваш вибір.")
else:
    print("Вибачте, я не розумію ваш вибір.")
